<template>
    <v-container>
        <v-card>
            <v-card-title class="d-flex">
                <div class="ma-2 pa-2 me-auto">{{ vacancy.name }}</div>
                <div class="ma-2 pa-2">{{ vacancy.companyName }}</div>
            </v-card-title>
            <v-card-text>
                <v-card-title> Описание </v-card-title>
                <div class="ml-3 pl-3">
                    {{ vacancy.description }}
                </div>
                <v-card-title> Требования </v-card-title>
                <div class="ml-3 pl-3">
                    {{ vacancy.requirements }}
                </div>
            </v-card-text>
        </v-card>
    </v-container>
</template>

<script>
import { useVacancyStore } from "../store/vacancy";
const vacancy = useVacancyStore();

export default {
    data() {
        return {
            id: 2,
            dialog: false,
            item: {
                title: "Backend developer",
                company: "NTR Lab",
                id: 1,
                desc: [
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                ],
                req: [
                    "Опыт работы с PHP 7+ ",
                    "Коммерческий опыт разработки веб-приложений",
                    "Опыт работы с PHP-фреймворками (Symfony, Laravel, Yii2)",
                ],
            },
            company: null,
        };
    },
    methods: {},
    computed: {
        vacancy() {
            return vacancy.vacancy;
        },
    },
    mounted() {
        vacancy.getVacancy({
            companyId: this.$route.query.companyId,
            id: this.$route.query.id,
        });
    },
};
</script>
