<template>
    <v-container>
        <v-card>
            <v-card-title class="d-flex">
                <div class="ma-2 pa-2 me-auto">{{ item.title }}</div>
                <div class="ma-2 pa-2">{{ item.company }}</div>
            </v-card-title>
            <v-card-text>
                <v-card-title> Описание </v-card-title>
                <v-list>
                    <li
                        v-for="(d, index) in item.desc"
                        :key="index"
                        class="ml-3"
                    >
                        {{ d }}
                    </li>
                </v-list>
                <v-card-title> Требования </v-card-title>
                <v-list>
                    <li
                        v-for="(d, index) in item.req"
                        :key="index"
                        class="ml-3"
                    >
                        {{ d }}
                    </li></v-list
                >
            </v-card-text>
        </v-card>
    </v-container>
</template>

<script>
import { useVacancyStore } from "../store/vacancy";
const vacancy = useVacancyStore();

export default {
    data() {
        return {
            id: 2,
            dialog: false,
            item: {
                title: "Backend developer",
                company: "NTR Lab",
                id: 1,
                desc: [
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                    "Большую часть времени предстоит заниматься разработкой backend приложения VITAMIN.TRADE для партнеров, а также его поддержкой и развитием ",
                    "Участие в обсуждении и выработка предложений по архитектуре разрабатываемых модулей",
                    "Реализация требуемого функционала в соответствии с принятыми архитектурными решениями",
                ],
                req: [
                    "Опыт работы с PHP 7+ ",
                    "Коммерческий опыт разработки веб-приложений",
                    "Опыт работы с PHP-фреймворками (Symfony, Laravel, Yii2)",
                ],
            },
            company: null,
        };
    },
    methods: {},
};
</script>
